{
    "<unk>": 0,
    "<pad>": 1,
    "<start>": 2,
    "<end>": 3,
    "create": 4,
    "string": 5,
    "s": 6,
    "integers": 7,
    "x1": 8,
    ",": 9,
    "y1": 10,
    "x2": 11,
    "y2": 12,
    "read": 13,
    "set": 14,
    "to": 15,
    "[": 16,
    "0": 17,
    "]": 18,
    "-": 19,
    "96": 20,
    "1": 21,
    "'0": 22,
    "'": 23,
    "print": 24,
    "maximum": 25,
    "of": 26,
    "absolute": 27,
    "value": 28,
    "and": 29,
    "newline": 30,
    "while": 31,
    "is": 32,
    "not": 33,
    "or": 34,
    "if": 35,
    "greater": 36,
    "than": 37,
    "``": 38,
    "R": 39,
    "''": 40,
    "increment": 41,
    "less": 42,
    "L": 43,
    "decrement": 44,
    "D": 45,
    "U": 46,
    "\\n": 47,
    "=": 48,
    "Read": 49,
    "(": 50,
    ")": 51,
    "!": 52,
    "OR": 53,
    "TRUE": 54,
    "do": 55,
    "the": 56,
    "following": 57,
    "a": 58,
    "new": 59,
    "line": 60,
    "character": 61,
    "array": 62,
    "c1": 63,
    "size": 64,
    "2": 65,
    "c2": 66,
    "vector": 67,
    "ans": 68,
    "add": 69,
    "element": 70,
    "RU": 71,
    "end": 72,
    "else": 73,
    "RD": 74,
    "LD": 75,
    "LU": 76,
    "for": 77,
    "i": 78,
    "exclusive": 79,
    "let": 80,
    "be": 81,
    "an": 82,
    "characters": 83,
    "length": 84,
    "strings": 85,
    "||": 86,
    "<": 87,
    "&": 88,
    "push": 89,
    "into": 90,
    "increase": 91,
    "by": 92,
    "one": 93,
    ">": 94,
    "decrease": 95,
    "all": 96,
    "elements": 97,
    "with": 98,
    "after": 99,
    "each": 100,
    "n": 101,
    "m": 102,
    "long": 103,
    "x": 104,
    "y": 105,
    "b": 106,
    "s1": 107,
    "int": 108,
    "-n": 109,
    "-m": 110,
    "bitwise": 111,
    "invert": 112,
    "sign": 113,
    "'R": 114,
    "'L": 115,
    "'U": 116,
    "'D": 117,
    "max": 118,
    "now": 119,
    "goal": 120,
    "way": 121,
    "100": 122,
    "step": 123,
    "tstep": 124,
    "-step": 125,
    ".": 126,
    "equal": 127,
    "'RD": 128,
    "'LD": 129,
    "'RU": 130,
    "'LU": 131,
    "S": 132,
    "49": 133,
    "97": 134,
    "Way": 135,
    "integer": 136,
    "counter": 137,
    "true": 138,
    "sign_X": 139,
    "/": 140,
    "sigh_Y": 141,
    "sign_Y": 142,
    "-1": 143,
    "break": 144,
    "loop": 145,
    "'\\n": 146,
    "empty": 147,
    "WAY": 148,
    "abs": 149,
    "otherwise": 150,
    "append": 151,
    "are": 152,
    "both": 153,
    "10": 154,
    "2d": 155,
    "csx": 156,
    "ctx": 157,
    "sx": 158,
    "sy": 159,
    "tx": 160,
    "ty": 161,
    "k": 162,
    "6": 163,
    "8": 164,
    "3": 165,
    "5": 166,
    "k-th": 167,
    "4": 168,
    "7": 169,
    "inclusive": 170,
    "declare": 171,
    "res": 172,
    "as": 173,
    "arguments": 174,
    "returning": 175,
    "return": 176,
    "from": 177,
    "function": 178,
    "xy": 179,
    "wtih": 180,
    "j": 181,
    "l": 182,
    "count": 183,
    "vec": 184,
    "result": 185,
    "run": 186,
    "that": 187,
    "returns": 188,
    "char": 189,
    "assign": 190,
    "called": 191,
    "aa": 192,
    "bb": 193,
    "values": 194,
    "creat": 195,
    "t": 196,
    "+": 197,
    "+1": 198,
    "define": 199,
    "symbol": 200,
    "d": 201,
    "short": 202,
    "'a": 203,
    "ints": 204,
    "d1": 205,
    "d2": 206,
    "min": 207,
    "minimum": 208,
    "casted": 209,
    "variable": 210,
    "inp": 211,
    ";": 212,
    "64": 213,
    "c": 214,
    "at": 215,
    "index": 216,
    "r": 217,
    "ctr": 218,
    "dr": 219,
    "dc": 220,
    "vectors": 221,
    "VI": 222,
    "VI2": 223,
    "VI3": 224,
    "VI4": 225,
    "f": 226,
    "RU\\n": 227,
    "RD\\n": 228,
    "LU\\n": 229,
    "LD\\n": 230,
    "U\\n": 231,
    "D\\n": 232,
    "R\\n": 233,
    "L\\n": 234,
    "arrays": 235,
    "xx": 236,
    "yy": 237,
    "y1-y2": 238,
    "start": 239,
    "endless": 240,
    "s2": 241,
    "c_x": 242,
    "c_y": 243,
    "d_y": 244,
    "d_x": 245,
    "-y": 246,
    "get": 247,
    "open": 248,
    "file": 249,
    "cp.inp": 250,
    "reading": 251,
    "cp.out": 252,
    "writing": 253,
    "CP.inp": 254,
    "mode": 255,
    "using": 256,
    "stream": 257,
    "stdin": 258,
    "CP.out": 259,
    "w": 260,
    "stdout": 261,
    "reference": 262,
    "in": 263,
    "t1": 264,
    "t2": 265,
    "q": 266,
    "v": 267,
    "z": 268,
    "u": 269,
    "G": 270,
    "minimal": 271,
    "sum": 272,
    "times": 273,
    "current": 274,
    "destination": 275,
    "input": 276,
    "udmoves": 277,
    "rlmoves": 278,
    "aboslute": 279,
    "o": 280,
    "p": 281,
    "multiply": 282,
    "longs": 283,
    "*": 284,
    "n1": 285,
    "n2": 286,
    "startx": 287,
    "starty": 288,
    "endx": 289,
    "endy": 290,
    "'1": 291,
    "starx": 292,
    "variables": 293,
    "type": 294,
    "i-th": 295,
    "d=": 296,
    "k=": 297,
    "dest": 298,
    "letter_start": 299,
    "letter_start=start": 300,
    "letter_dest": 301,
    "num_start": 302,
    "num_dest": 303,
    "v1": 304,
    "v2": 305,
    "v1+v2-minimum": 306,
    "i1": 307,
    "i2": 308,
    "l1": 309,
    "l2": 310,
    "-'a": 311,
    "-'1": 312,
    "str": 313,
    "1000": 314,
    "y1=": 315,
    "subtract": 316,
    "cx": 317,
    "cy": 318,
    "dx": 319,
    "dy": 320,
    "48": 321,
    "xd": 322,
    "yd": 323,
    "decrementing": 324,
    "can": 325,
    "mx": 326,
    "-s2": 327,
    "rx": 328,
    "ry": 329,
    "xf": 330,
    "yf": 331,
    "kol": 332,
    "==": 333,
    "{": 334,
    "}": 335,
    "xie": 336,
    "r1": 337,
    "r2": 338,
    "=integers": 339,
    "=string": 340,
    "1001": 341,
    "cnt": 342,
    "content": 343,
    "indices": 344,
    "through": 345,
    "xs": 346,
    "ys": 347,
    "xt": 348,
    "yt": 349,
    "200": 350,
    "yet": 351,
    "yes": 352,
    "p1": 353,
    "p2": 354,
    "chars": 355,
    "pointers": 356,
    "lesser": 357,
    "--": 358,
    "inline": 359,
    "no": 360,
    "ch": 361,
    "digit": 362,
    "'-": 363,
    "bitshift": 364,
    "left": 365,
    "fx": 366,
    "fy": 367,
    "incremented": 368,
    "whitespace": 369,
    "getchar": 370,
    "inccrement": 371,
    "gap": 372,
    "terminated": 373,
    "discard": 374,
    "hi2": 375,
    "then": 376,
    "ex": 377,
    "ey": 378,
    "flag1": 379,
    "flag2": 380,
    "fabs": 381,
    "ex-sx": 382,
    "ey-sy": 383,
    "argument": 384,
    "on": 385,
    "every": 386,
    "iteration": 387,
    "diag": 388,
    "diag2": 389,
    "i1-l1": 390,
    "getint": 391,
    "'9": 392,
    "-a": 393,
    "excluisve": 394,
    "absoluve": 395,
    "integet": 396,
    "truthy": 397,
    "more": 398,
    "reduce": 399,
    "lessen": 400,
    "fastIo": 401,
    "invoke": 402,
    "MAT": 403,
    "LC": 404,
    "RC": 405,
    "TR": 406,
    "BR": 407,
    "boolean": 408,
    "first": 409,
    "false": 410,
    "'*": 411,
    "min_i": 412,
    "min_j": 413,
    "max_i": 414,
    "max_j": 415,
    "51": 416,
    "55": 417,
    "check": 418,
    "mn": 419,
    "888888": 420,
    "m1": 421,
    "m2": 422,
    "444": 423,
    "ar": 424,
    "uper": 425,
    "lowar": 426,
    "right": 427,
    "ck": 428,
    "con": 429,
    "h1": 430,
    "stop": 431,
    "h2": 432,
    "until": 433,
    "2e9": 434,
    "66": 435,
    "6666": 436,
    "finishx": 437,
    "finishy": 438,
    "startx=55": 439,
    "starty=55": 440,
    "st": 441,
    "90": 442,
    "hangx": 443,
    "4409": 444,
    "coty": 445,
    "4999": 446,
    "tt": 447,
    "xaydung": 448,
    "hang": 449,
    "cot": 450,
    "void": 451,
    "bao1": 452,
    "bao2": 453,
    "demx": 454,
    "demy": 455,
    "maxx": 456,
    "col": 457,
    "tt-1": 458,
    "sort": 459,
    "chodoi": 460,
    "call": 461,
    "-100": 462,
    "A": 463,
    "xmin": 464,
    "xmax": 465,
    "ymin": 466,
    "ymax": 467,
    "mat": 468,
    "e": 469,
    "counting": 470,
    "down": 471,
    "50": 472,
    "substring": 473,
    "arr": 474,
    "up": 475,
    "mni": 476,
    "mnj": 477,
    "mxi": 478,
    "mxj": 479,
    "INT_MAX": 480,
    "miny": 481,
    "maxy": 482,
    "minx": 483,
    "ch1": 484,
    "ch2": 485,
    "ch3": 486,
    "ch4": 487,
    "x0": 488,
    "y0": 489,
    "go": 490,
    "jump": 491,
    "point": 492,
    "=n": 493,
    "label": 494,
    "lx": 495,
    "ly": 496,
    "constant": 497,
    "MOD": 498,
    "1000000007": 499,
    "INF": 500,
    "INF2": 501,
    "1000000007LL": 502,
    "double": 503,
    "EPS": 504,
    "1e-9": 505,
    "minj": 506,
    "maxi": 507,
    "maxj": 508,
    "-INF": 509,
    "mini": 510,
    "a1": 511,
    "a2": 512,
    "a3": 513,
    "a4": 514,
    "lett": 515,
    "errl": 516,
    "err": 517,
    "alt": 518,
    "ust": 519,
    "sag": 520,
    "sol": 521,
    "-1000": 522,
    "incluisive": 523,
    "60": 524,
    "500": 525,
    "endj": 526,
    "incrementing": 527,
    "endi": 528,
    "99999999": 529,
    "101": 530,
    "lu": 531,
    "ru": 532,
    "ld": 533,
    "rd": 534,
    "100000": 535,
    "hi": 536,
    "hj": 537,
    "li": 538,
    "lj": 539,
    "flag": 540,
    "gg": 541,
    "0x3f": 542,
    "m3": 543,
    "m4": 544,
    "map": 545,
    "booleans": 546,
    "g": 547,
    "52": 548,
    "X": 549,
    "Y": 550,
    "999999": 551,
    "ok": 552,
    "999": 553,
    "mini1": 554,
    "mini2": 555,
    "maxi1": 556,
    "maxi2": 557,
    "imx": 558,
    "imn": 559,
    "jmx": 560,
    "jmn": 561,
    "1222": 562,
    "-2019": 563,
    "MX": 564,
    "1e4": 565,
    "continue": 566,
    "arr1": 567,
    "imin": 568,
    "imax": 569,
    "jmin": 570,
    "jmax": 571,
    "imex": 572,
    "row_min": 573,
    "row_max": 574,
    "9": 575,
    "11": 576,
    "fill": 577,
    "%": 578,
    "i=": 579,
    "34298343": 580,
    "2193809": 581,
    "data": 582,
    "initialized": 583,
    "craete": 584,
    "row": 585,
    "graph": 586,
    "start_x": 587,
    "start_y": 588,
    "end_x": 589,
    "end_y": 590,
    "Min_X": 591,
    "Min_Y": 592,
    "Max_X": 593,
    "Max_Y": 594,
    "**sheet": 595,
    "minRow": 596,
    "minCol": 597,
    "maxRow": 598,
    "maxCol": 599,
    "sheet": 600,
    "pointer": 601,
    "**shap": 602,
    "shap": 603,
    "newchar": 604,
    "rows": 605,
    "colums": 606,
    "rowe": 607,
    "colume": 608,
    "user": 609,
    "change": 610,
    "name": 611,
    "standard": 612,
    "output": 613,
    "N": 614,
    "123": 615,
    "1e9": 616,
    "KIOT_camp": 617,
    "x3": 618,
    "y3": 619,
    "x4": 620,
    "y4": 621,
    "exit": 622,
    "m=int": 623,
    "s=vector": 624,
    "checktop": 625,
    "args": 626,
    "i=0": 627,
    "j=0": 628,
    "checkbottom": 629,
    "i=n-1": 630,
    "checkleft": 631,
    "checkright": 632,
    "i=m-1": 633,
    "resize": 634,
    "left=checkleft": 635,
    "right=checkright": 636,
    "top=checktop": 637,
    "bottom=checkbottom": 638,
    "i=top": 639,
    "bottom": 640,
    "starting": 641,
    "len": 642,
    "right-left+1": 643,
    "n-1": 644,
    "m-1": 645,
    "flag=0": 646,
    "i=u": 647,
    "j=l": 648,
    "#": 649,
    "modulo": 650,
    "odd": 651,
    "where": 652,
    "'\\0": 653,
    "bitwise-and": 654,
    "multiple": 655,
    "even": 656,
    ".\\n": 657,
    "const": 658,
    "maxn": 659,
    "200000": 660,
    "zw": 661,
    "make": 662,
    "pair": 663,
    "30": 664,
    "ss": 665,
    "sss": 666,
    "falsy": 667,
    "temp": 668,
    "uneven": 669,
    "=1": 670,
    "adding": 671,
    "further": 672,
    "1e5": 673,
    "nn": 674,
    "305": 675,
    "method": 676,
    "different": 677,
    "flg": 678,
    "=0": 679,
    "lie": 680,
    "skip": 681,
    "rest": 682,
    "filled": 683,
    "changing": 684,
    "increasing": 685,
    "setting": 686,
    "printing": 687,
    "rem": 688,
    "v3": 689,
    "make_pair": 690,
    "se": 691,
    "h": 692,
    "mod": 693,
    "pritn": 694,
    "n't": 695,
    "reset": 696,
    "i=1": 697,
    "m=": 698,
    "i=i+2": 699,
    "exclusivem": 700,
    "i+1": 701,
    "endline": 702,
    "fastio": 703,
    "m=long": 704,
    "120": 705,
    "2000010": 706,
    "taking": 707,
    "mul": 708,
    "1LL": 709,
    "?": 710,
    ":": 711,
    "10000": 712,
    "isitright": 713,
    "j=1": 714,
    "s=0": 715,
    "a-1": 716,
    "v=0": 717,
    "b-1": 718,
    "n/2": 719,
    "l=0": 720,
    "k=1": 721,
    "k=2": 722,
    "1.exclusive": 723,
    "bool": 724,
    "col-1": 725,
    "j=m": 726,
    "20": 727,
    "but": 728,
    "last": 729,
    "equals": 730,
    "power": 731,
    "modi": 732,
    "res=1": 733,
    "res=": 734,
    "res*a": 735,
    "divide": 736,
    "a=": 737,
    "a*a": 738,
    "dirx=array": 739,
    "-1,0,0,1,1,1": 740,
    "diry=array": 741,
    "-1,0,1": 742,
    "-1,1": 743,
    "dx=array": 744,
    "-1,1,0,0": 745,
    "dy=array": 746,
    "0,0": 747,
    "y=int": 748,
    "cur=0": 749,
    "c=int": 750,
    "a=array": 751,
    "1005": 752,
    "r=string": 753,
    "c=0": 754,
    "decremented": 755,
    "column": 756,
    "s3": 757,
    "columns": 758,
    "**p": 759,
    "assigning": 760,
    "TESTS": 761,
    "j=m-1": 762,
    "ma": 763,
    "iterate": 764,
    "lol": 765,
    "flag=1": 766,
    "rtr": 767,
    "4=0": 768,
    "num": 769,
    "o=true": 770,
    "o=false": 771,
    "j=int": 772,
    "part": 773,
    "c=1": 774,
    "flag=false": 775,
    "flag=true": 776,
    "mxn": 777,
    "sizeof": 778,
    "bytes": 779,
    "i/2": 780,
    "event": 781,
    "check=1": 782,
    "check=0": 783,
    "statement": 784,
    "mk": 785,
    "which": 786,
    "takes": 787,
    "i*i": 788,
    "evenly": 789,
    "divisible": 790,
    "1000005": 791,
    "intergers": 792,
    "YES": 793,
    "NO": 794,
    "l+1+i": 795,
    "YES\\n": 796,
    "NO\\n": 797,
    "SZ": 798,
    "1003": 799,
    "isprime": 800,
    "sieve": 801,
    "iprime": 802,
    "primes": 803,
    "isPrime": 804,
    "ji": 805,
    "prime": 806,
    "j+1": 807,
    "ifprime": 808,
    "squared": 809,
    "divides": 810,
    "without": 811,
    "remainder": 812,
    "good": 813,
    "3000": 814,
    "i+last+1": 815,
    "falst": 816,
    "sq": 817,
    "ceil": 818,
    "square": 819,
    "root": 820,
    "1005+0.0": 821,
    "prn": 822,
    "pr": 823,
    "j*j": 824,
    "next": 825,
    "primos": 826,
    "esPrimo": 827,
    "primo": 828,
    "n+1": 829,
    "1111": 830,
    "plen": 831,
    "incresing": 832,
    "last+i+1": 833,
    "i-1": 834,
    "bitset": 835,
    "was": 836,
    "100010": 837,
    "bits": 838,
    "bit": 839,
    "sqrt": 840,
    "fase": 841,
    "a^2": 842,
    "divided": 843,
    "defined": 844,
    "1010": 845,
    "visit": 846,
    "++*p": 847,
    "*p": 848,
    "MAXN": 849,
    "pd": 850,
    "find_prime": 851,
    "find": 852,
    "mid": 853,
    "mz": 854,
    "pos": 855,
    "i*prime": 856,
    "tmp": 857,
    "ju": 858,
    "insert": 859,
    "iterator": 860,
    "it": 861,
    "beginning": 862,
    "1,1": 863,
    "2002": 864,
    "puts": 865,
    "isp": 866,
    "Primes": 867,
    "20000": 868,
    "fin": 869,
    "30000": 870,
    "seive": 871,
    "exists": 872,
    "prevI": 873,
    "2000": 874,
    "memset": 875,
    "test": 876,
    "File": 877,
    "output.txt": 878,
    "input.txt": 879,
    "fast": 880,
    "pi": 881,
    "3.1415926": 882,
    "1e3": 883,
    "solve": 884,
    "address": 885,
    "is_prime": 886,
    "mark": 887,
    "nextPrime": 888,
    "noldbach": 889,
    "nextPrimeNum": 890,
    "error": 891,
    "arrar": 892,
    "pri": 893,
    "168": 894,
    "increments": 895,
    "1000+10": 896,
    "*i": 897,
    "cin": 898,
    "4000": 899,
    "binary_search": 900,
    "1009": 901,
    "incremement": 902,
    "+prime": 903,
    "i-2": 904,
    "zero": 905,
    "sievesize": 906,
    "bs": 907,
    "600": 908,
    "putprime": 909,
    "isNoldPrime": 910,
    "*2": 911,
    "returned": 912,
    "peimrs": 913,
    "=x": 914,
    "judge": 915,
    "ii": 916,
    "tp": 917,
    "cm": 918,
    "lt": 919,
    "has": 920,
    "assigned": 921,
    "flush": 922,
    "condition": 923,
    "met": 924,
    "so": 925,
    "pp": 926,
    "2222": 927,
    "pm": 928,
    "modulus": 929,
    "pm2": 930,
    "i+j+1": 931,
    "pv": 932,
    "oolean": 933,
    "lt+i+1": 934,
    "os": 935,
    "100001": 936,
    "1000010": 937,
    "phi": 938,
    "primesize": 939,
    "register": 940,
    "isdigit": 941,
    "getlist": 942,
    "listsize": 943,
    "pre": 944,
    "init": 945,
    "+=": 946,
    "get_prime": 947,
    "*it": 948,
    "instance": 949,
    "w=": 950,
    "euql": 951,
    "86": 952,
    "steps": 953,
    "cnd": 954,
    "87": 955,
    "rounded": 956,
    "book": 957,
    "is_p": 958,
    "Seive": 959,
    "CalculatePrimes": 960,
    "limit": 961,
    "sums": 962,
    "primes.size": 963,
    "sums.push_back": 964,
    "sums.size": 965,
    "primes.begin": 966,
    "primes.end": 967,
    "inf": 968,
    "1e18": 969,
    "x=int": 970,
    "y=x/2": 971,
    "z=0": 972,
    "x-2*y": 973,
    "y=0": 974,
    "y=1": 975,
    "x/2": 976,
    "cont": 977,
    "star": 978,
    "display": 979,
    "tmp/2": 980,
    "dCount": 981,
    "starCount": 982,
    "decreasing": 983,
    "mf": 984,
    "tr": 985,
    "max_n": 986,
    "show": 987,
    "float": 988,
    "draw": 989,
    "202": 990,
    "201": 991,
    "2==0||n": 992,
    "Mid": 993,
    "DiamondCount": 994,
    "c=array": 995,
    "110": 996,
    "r=int": 997,
    "='*": 998,
    "n/2+1": 999,
    "='D": 1000,
    "=l": 1001,
    "keep": 1002,
    "going": 1003,
    "doubles": 1004,
    "301": 1005,
    "numD": 1006,
    "numStar": 1007,
    "kkk": 1008,
    "a.first": 1009,
    "b.first": 1010,
    "a.second": 1011,
    "b.second": 1012,
    "inc": 1013,
    "iskom": 1014,
    "k1": 1015,
    "dem": 1016,
    "MD": 1017,
    "1000000009": 1018,
    "2e3": 1019,
    "33": 1020,
    "n=int": 1021,
    "s=array": 1022,
    "n/2-i": 1023,
    "j=n/2+1": 1024,
    "n-j-1": 1025,
    "i=n/2+1": 1026,
    "n-i-1": 1027,
    "sized": 1028,
    "matrix": 1029,
    "/2": 1030,
    "n/2-1": 1031,
    "write": 1032,
    "M": 1033,
    "K": 1034,
    "H": 1035,
    "W": 1036,
    "1000x1000": 1037,
    "forij": 1038,
    "key": 1039,
    "modpow": 1040,
    "u=modpow": 1041,
    "u=": 1042,
    "u*u": 1043,
    "u*x": 1044,
    "k=int": 1045,
    "tt=0": 1046,
    "e=0": 1047,
    "p=0": 1048,
    "n-k": 1049,
    "tt=1": 1050,
    "minus": 1051,
    "table": 1052,
    "half": 1053,
    "exlclusive": 1054,
    "102": 1055,
    "Size": 1056,
    "nothing": 1057,
    "i-n/2": 1058,
    "+abs": 1059,
    "j-n/2": 1060,
    "printDiamond": 1061,
    "diamond": 1062,
    "dotNum": 1063,
    "plus": 1064,
    "between": 1065,
    "m-i": 1066,
    "m+i": 1067,
    "abort": 1068,
    "program": 1069,
    "md": 1070,
    "endl": 1071,
    "sz": 1072,
    "s4": 1073,
    "s5": 1074,
    "s6": 1075,
    "ar2": 1076,
    "brainfuck": 1077,
    "=int": 1078,
    "n-i*2-1": 1079,
    "i*2+1": 1080,
    "n-i2*2-1": 1081,
    "i2*2+1": 1082,
    "icrement": 1083,
    "stars": 1084,
    "ds": 1085,
    "mp": 1086,
    "n-": 1087,
    "2*i+1": 1088,
    "x=0": 1089,
    "o=0": 1090,
    "i=n-2-1": 1091,
    "i+2": 1092,
    "n-i/2": 1093,
    "i=n-2": 1094,
    "n+i/2": 1095,
    "2.0": 1096,
    "accepts": 1097,
    "x-i": 1098,
    "x+i": 1099,
    "od": 1100,
    "boost": 1101,
    "Vector": 1102,
    "star_count": 1103,
    "d_count": 1104,
    "back": 1105,
    "looping": 1106,
    "nprint": 1107,
    "0x3f3f3f3f": 1108,
    "nd": 1109,
    "ns": 1110,
    "out": 1111,
    "t3": 1112,
    "j-1": 1113,
    "arr2": 1114,
    "colom": 1115,
    "toggle": 1116,
    "number": 1117,
    "input=array": 1118,
    "=input": 1119,
    "containing": 1120,
    "Assign": 1121,
    "2e5": 1122,
    "off_or_on": 1123,
    "bin": 1124,
    "two": 1125,
    "dimensional": 1126,
    "sizes": 1127,
    "light": 1128,
    "C": 1129,
    "n_i": 1130,
    "n_j": 1131,
    "dimensions": 1132,
    "pole": 1133,
    "naj": 1134,
    "iii": 1135,
    "ii+1": 1136,
    "ii-1": 1137,
    "isvalid": 1138,
    "curr": 1139,
    "actions": 1140,
    "AND": 1141,
    "NOT": 1142,
    "cpy": 1143,
    "lights": 1144,
    "off": 1145,
    "j1": 1146,
    "press": 1147,
    "ar1": 1148,
    "contents": 1149,
    "width": 1150,
    "11111": 1151,
    "jj": 1152,
    "remove": 1153,
    "imprimir": 1154,
    "encender": 1155,
    "aux": 1156,
    "TOOG": 1157,
    "_i": 1158,
    "ni": 1159,
    "nj=": 1160,
    "_j": 1161,
    "nj": 1162,
    "*a": 1163,
    "*a=0": 1164,
    "*a=1": 1165,
    "isval": 1166,
    "0\\n": 1167,
    "1\\n": 1168,
    "grid": 1169,
    "ar=array": 1170,
    "x=long": 1171,
    "=1-ar": 1172,
    "modd": 1173,
    "-1LL": 1174,
    "dir": 1175,
    "arr=array": 1176,
    "=fabs": 1177,
    "dimension": 1178,
    "+a": 1179,
    "5x5": 1180,
    "ara": 1181,
    "arx": 1182,
    "ary": 1183,
    "y=j": 1184,
    "checkodd": 1185,
    "b=array": 1186,
    "1-b": 1187,
    "bitwise-xor": 1188,
    "ou": 1189,
    "3x3": 1190,
    "incement": 1191,
    "T=string": 1192,
    "val": 1193,
    "a=long": 1194,
    "B=array": 1195,
    "C=char": 1196,
    "sum=A": 1197,
    "+A": 1198,
    "pdd": 1199,
    "ans=array": 1200,
    "sum=input": 1201,
    "matrices": 1202,
    "|": 1203,
    ".|D|": 1204,
    ".|.|": 1205,
    "...": 1206,
    "..|": 1207,
    "23": 1208,
    "'O": 1209,
    "21": 1210,
    "outer": 1211,
    "inner": 1212,
    "O": 1213,
    "|D|": 1214,
    "|.|": 1215,
    "..|\\n": 1216,
    "|.|\\n": 1217,
    "copy": 1218,
    "zz": 1219,
    "kk": 1220,
    "numbers": 1221,
    "12": 1222,
    "single": 1223,
    "9999999999999": 1224,
    "db": 1225,
    "'|": 1226,
    "|O": 1227,
    "k2": 1228,
    "k3": 1229,
    "ost": 1230,
    "ind": 1231,
    "24": 1232,
    "followin": 1233,
    "..": 1234,
    "bus": 1235,
    "1st": 1236,
    "2nd": 1237,
    "3rd": 1238,
    "4th": 1239,
    "5th": 1240,
    "6th": 1241,
    "27": 1242,
    "ith": 1243,
    "22": 1244,
    "+\\n": 1245,
    "|O.": 1246,
    "|O.O.": 1247,
    "|O.O.O.": 1248,
    "|O.O.O.O.": 1249,
    "13": 1250,
    "14": 1251,
    "|O.O.O.O.O.": 1252,
    "15": 1253,
    "16": 1254,
    "17": 1255,
    "|O.O.O.O.O.O.": 1256,
    "18": 1257,
    "19": 1258,
    "|O.O.O.O.O.O.O.": 1259,
    "|O.O.O.O.O.O.O.O.": 1260,
    "25": 1261,
    "26": 1262,
    "|O.O.O.O.O.O.O.O.O.": 1263,
    "28": 1264,
    "29": 1265,
    "|O.O.O.O.O.O.O.O.O.O.": 1266,
    "31": 1267,
    "32": 1268,
    "|O.O.O.O.O.O.O.O.O.O.O.|D|": 1269,
    "|O.O.O.O.O.O.O.O.O.O.O.|.|": 1270,
    "34": 1271,
    "Pi": 1272,
    "arc": 1273,
    "cosine": 1274,
    "-1.0": 1275,
    "11th": 1276,
    "proceed": 1277,
    "th": 1278,
    "infinite": 1279,
    "idx": 1280,
    "4x11": 1281,
    "second": 1282,
    "move": 1283,
    "passengers": 1284,
    "ttttttttttttttttttttttttttt": 1285,
    "'+": 1286,
    "fo": 1287,
    "ri": 1288,
    "'t": 1289,
    "che": 1290,
    "acos": 1291,
    "sandali": 1292,
    "0th": 1293,
    "jth": 1294,
    "a=1": 1295,
    "3*": 1296,
    "+2": 1297,
    ".|": 1298,
    "3*a+4": 1299,
    "calc_subtractions_slow": 1300,
    "inlined": 1301,
    "numOps": 1302,
    "calc_subtractions_div": 1303,
    "calc_subtractions_mod": 1304,
    "calc_subtractions": 1305,
    "subtractions_solve": 1306,
    "numPairs": 1307,
    "cout": 1308,
    "b=int": 1309,
    "ans=0": 1310,
    "a/b": 1311,
    "a=a": 1312,
    "b/a": 1313,
    "b=b": 1314,
    "swap": 1315,
    "hasil": 1316,
    "ret": 1317,
    "tc": 1318,
    "cnt=0": 1319,
    "MAX=max": 1320,
    "MIN=min": 1321,
    "MAX": 1322,
    "MIN": 1323,
    "MAX/MIN": 1324,
    "temp=MIN": 1325,
    "MIN=MAX-MIN*": 1326,
    "MAX=temp": 1327,
    "T": 1328,
    "unsigned": 1329,
    "swp": 1330,
    "addresses": 1331,
    "test_div": 1332,
    "1000000000": 1333,
    "999999999": 1334,
    "test_mod": 1335,
    "getNumbers": 1336,
    "gotValue": 1337,
    "gotVale": 1338,
    "subtractions_solve_low": 1339,
    "istream": 1340,
    "ostream": 1341,
    "subtractions_solve_fast": 1342,
    "getline": 1343,
    "nums": 1344,
    "round": 1345,
    "1.0": 1346,
    "x/y": 1347,
    "y/x": 1348,
    "=y": 1349,
    "Q": 1350,
    "cntint": 1351,
    "cntfloat": 1352,
    "adivb": 1353,
    "bdiva": 1354,
    "total": 1355,
    "positive": 1356,
    "a/b*b": 1357,
    "b/a*a": 1358,
    "doit": 1359,
    "1ll": 1360,
    "we": 1361,
    "valid": 1362,
    "orderArguments": 1363,
    "arg1": 1364,
    "arg2": 1365,
    "subtraction": 1366,
    "areg2": 1367,
    "arg1=": 1368,
    "arg2=": 1369,
    "quotient": 1370,
    "evaluate": 1371,
    "numOfTestCases": 1372,
    "casos": 1373,
    "modu": 1374,
    "cases": 1375,
    "num1": 1376,
    "num2": 1377,
    "ops": 1378,
    "gcd": 1379,
    "getans": 1380,
    "GCD": 1381,
    "decreased": 1382,
    "10000002": 1383,
    "1000001": 1384,
    "cift": 1385,
    "tek": 1386,
    "doIt": 1387,
    "t_ab": 1388,
    "t_a": 1389,
    "t_b": 1390,
    "calling": 1391,
    "bigger": 1392,
    "lower": 1393,
    "rad": 1394,
    "smaller": 1395,
    "larger": 1396,
    "mult": 1397,
    "infinitely": 1398,
    "a=b": 1399,
    "a=0": 1400,
    "b=": 1401,
    "gcd_answ": 1402,
    "initialize": 1403,
    "settings": 1404,
    "1073741824": 1405,
    "MAX1": 1406,
    "3e8": 1407,
    "b=long": 1408,
    "x=max": 1409,
    "y=min": 1410,
    "*y": 1411,
    "m=max": 1412,
    "n=min": 1413,
    "x=m": 1414,
    "y=n": 1415,
    "B": 1416,
    "Calc": 1417,
    "0LL": 1418,
    "tc=int": 1419,
    "res=0": 1420,
    "h=b-a": 1421,
    "a-h": 1422,
    "h/a": 1423,
    "co": 1424,
    "shift": 1425,
    "places": 1426,
    "int64_t": 1427,
    "modex": 1428,
    "dv": 1429,
    "c=long": 1430,
    "r=0": 1431,
    "x=a": 1432,
    "b=x": 1433,
    "c=b/a": 1434,
    "b=b-a*c": 1435,
    "iterations": 1436,
    "noop": 1437,
    "final": 1438,
    "path": 1439,
    "txt.in": 1440,
    "txt.out": 1441,
    "fixed": 1442,
    "setprecision": 1443,
    "kq": 1444,
    "xuli": 1445,
    "_": 1446,
    "lcm": 1447,
    "retutn": 1448,
    "100005": 1449,
    "say": 1450,
    "cmd": 1451,
    "people_cnt": 1452,
    "maxs": 1453,
    "100+10": 1454,
    "unique": 1455,
    "skipping": 1456,
    "erase": 1457,
    "save": 1458,
    "position": 1459,
    "EOF": 1460,
    "1000000": 1461,
    "105": 1462,
    "byte": 1463,
    "active": 1464,
    "ineger": 1465,
    "commands": 1466,
    "person": 1467,
    "mark_idx": 1468,
    "send_size": 1469,
    "unintialized": 1470,
    "time": 1471,
    "neither": 1472,
    "colon": 1473,
    "followed": 1474,
    "1e2": 1475,
    "creatre": 1476,
    "mygets": 1477,
    "me": 1478,
    "characterfrom": 1479,
    "gets": 1480,
    "c3": 1481,
    "infinity": 1482,
    "comando": 1483,
    "ln": 1484,
    "n_participantes": 1485,
    "n_bytes": 1486,
    "n_participantes=0": 1487,
    "n_bytes=0": 1488,
    "linha_chat": 1489,
    "10005": 1490,
    "sm": 1491,
    "idx-1": 1492,
    "s.size": 1493,
    "local": 1494,
    "vis": 1495,
    "205": 1496,
    "vis.count": 1497,
    "strlen": 1498,
    "vis.size": 1499,
    "cine": 1500,
    "command": 1501,
    "id": 1502,
    "clear": 1503,
    "command.substr": 1504,
    "command.size": 1505,
    "lens": 1506,
    "frq": 1507,
    "count1": 1508,
    "store": 1509,
    "users": 1510,
    "traffic": 1511,
    "olnum": 1512,
    "charnum": 1513,
    "charsum": 1514,
    "indefinitely": 1515,
    "inpu": 1516,
    "coun": 1517,
    "count_now": 1518,
    "FindLen": 1519,
    "Set": 1520,
    "'s": 1521,
    "check1": 1522,
    "lengh": 1523,
    "txt": 1524,
    "ampty": 1525,
    "found": 1526,
    "answer": 1527,
    "100011": 1528,
    "decimal": 1529,
    "precision": 1530,
    "format": 1531,
    "cnt1": 1532,
    "cnt2": 1533,
    "tot": 1534,
    "incremen": 1535,
    "resp": 1536,
    "qClose": 1537,
    "1000000000000": 1538,
    "5001": 1539,
    "cur": 1540,
    "5050": 1541,
    "displayed": 1542,
    "utilize": 1543,
    "decimals": 1544,
    "fixed-point": 1545,
    "notation": 1546,
    "qmarks": 1547,
    "j=i": 1548,
    "1e7": 1549,
    "r-1": 1550,
    "5000": 1551,
    "fail": 1552,
    "-c": 1553,
    "j=u": 1554,
    "q+1": 1555,
    "c+q": 1556,
    "5010": 1557,
    "l=length": 1558,
    "l-1": 1559,
    "x+z": 1560,
    "y-z": 1561,
    "siz": 1562,
    "tmp2": 1563,
    "5e3": 1564,
    "dp": 1565,
    "sum1": 1566,
    "sum2": 1567,
    "sum3": 1568,
    "negative": 1569,
    "5005": 1570,
    "sup": 1571,
    "q=0": 1572,
    "3f3f3f3f": 1573,
    "exadecimal": 1574,
    "N=5050": 1575,
    "MAXN=5005": 1576,
    "vis=array": 1577,
    "s=string": 1578,
    "n=size": 1579,
    "j-i+1": 1580,
    "zuo": 1581,
    "wen": 1582,
    "que": 1583,
    "floating": 1584,
    "s=": 1585,
    "contstant": 1586,
    "recude": 1587,
    "god": 1588,
    "stirng": 1589,
    "kh": 1590,
    "zeroing": 1591,
    "them": 1592,
    "Terminate": 1593,
    "integral": 1594,
    "MAX_N": 1595,
    "1,000,000": 1596,
    "hex": 1597,
    "1e-10": 1598,
    "rt": 1599,
    "cout.precision": 1600,
    "ed": 1601,
    "f=0": 1602,
    "i=i+k": 1603,
    "f=1": 1604,
    "'G": 1605,
    "'T": 1606,
    "'A": 1607,
    "'Z": 1608,
    "initial": 1609,
    "indexT": 1610,
    "indexG": 1611,
    "size_t": 1612,
    "inreasing": 1613,
    "crate": 1614,
    "start=0": 1615,
    "len=0": 1616,
    "c=": 1617,
    "start=1": 1618,
    "n=0": 1619,
    "s=i": 1620,
    "t=i": 1621,
    "i=s": 1622,
    "i+k": 1623,
    "i-k": 1624,
    "location": 1625,
    "BFS": 1626,
    "tar": 1627,
    "subtracting": 1628,
    "loc1": 1629,
    "loc2": 1630,
    "1120": 1631,
    "x=i": 1632,
    "y=i": 1633,
    "i=y": 1634,
    "+k": 1635,
    "a=i": 1636,
    "b=i": 1637,
    "i=a": 1638,
    "loct": 1639,
    "locg": 1640,
    "rue": 1641,
    "incrment": 1642,
    "r=1": 1643,
    "No": 1644,
    "dfs": 1645,
    "g=i": 1646,
    "i=g": 1647,
    "suucessful": 1648,
    "termination": 1649,
    "diff": 1650,
    "t-10": 1651,
    "diff=1": 1652,
    "-10": 1653,
    "G'or": 1654,
    "indG": 1655,
    "indT": 1656,
    "inputs": 1657,
    "insect": 1658,
    "=a": 1659,
    "Start": 1660,
    "End": 1661,
    "i=Start": 1662,
    "l=i": 1663,
    "m=i": 1664,
    "i=l": 1665,
    "i=i-k": 1666,
    "c=c+1": 1667,
    "hap": 1668,
    "m1=map": 1669,
    "lo": 1670,
    "itr=iterator": 1671,
    "k=long": 1672,
    "pos1": 1673,
    "pos2=long": 1674,
    "pos1=i": 1675,
    "pos2=i": 1676,
    "pos2": 1677,
    "100007": 1678,
    "_s": 1679,
    "_f": 1680,
    "k=min": 1681,
    "locg-loct": 1682,
    "post": 1683,
    "s8i": 1684,
    "st=-1": 1685,
    "ed=-1": 1686,
    "st=i": 1687,
    "ed=i": 1688,
    "i=st": 1689,
    "-k": 1690,
    "ti": 1691,
    "tg": 1692,
    "space": 1693,
    "str1": 1694,
    "str2": 1695,
    "str3": 1696,
    "days": 1697,
    "nonzero": 1698,
    "strcpy": 1699,
    "n1a": 1700,
    "n2a": 1701,
    "push_back": 1702,
    "sir1": 1703,
    "sir2": 1704,
    "p=string": 1705,
    "s1=p": 1706,
    "s2=p": 1707,
    "maxN": 1708,
    "1e6": 1709,
    "1e10": 1710,
    "s=a": 1711,
    "killed": 1712,
    "added": 1713,
    "day": 1714,
    "aa=a": 1715,
    "aa=b": 1716,
    "linf": 1717,
    "62": 1718,
    "iinf": 1719,
    "dinf": 1720,
    "1e17": 1721,
    "Mod": 1722,
    "100006": 1723,
    "c=a": 1724,
    "a=d": 1725,
    "b=string": 1726,
    "y=string": 1727,
    "a=y": 1728,
    "b=y": 1729,
    "=d": 1730,
    "readind": 1731,
    "rep": 1732,
    "kill": 1733,
    "na1": 1734,
    "na2": 1735,
    "n1=": 1736,
    "str4": 1737,
    "=integer": 1738,
    "compare": 1739,
    "copies": 1740,
    "pointed": 1741,
    "MAX2": 1742,
    "eps": 1743,
    "pot1": 1744,
    "pot2": 1745,
    "crete": 1746,
    "vict": 1747,
    "ele": 1748,
    "bal": 1749,
    "counts": 1750,
    "1e-8": 1751,
    "pod": 1752,
    "pod1": 1753,
    "res_arr": 1754,
    "to_be_replaced": 1755,
    "replaced_by": 1756,
    "name1": 1757,
    "name2": 1758,
    "temp1": 1759,
    "temp2": 1760,
    "1024": 1761,
    ".first": 1762,
    ".second": 1763,
    "=B": 1764,
    "=b": 1765,
    "=A": 1766,
    "af": 1767,
    "nex": 1768,
    "ft": 1769,
    "q.count": 1770,
    "s1.compare": 1771,
    "a=s": 1772,
    "s=b": 1773,
    "a0": 1774,
    "b0": 1775,
    "replacement": 1776,
    "a+y": 1777,
    "b+y": 1778,
    "death": 1779,
    "s3=s1": 1780,
    "setIO": 1781,
    "same": 1782,
    "b1": 1783,
    "vs": 1784,
    "Time": 1785,
    "elapsed": 1786,
    "clock": 1787,
    "CLOCKS_PER_SEC": 1788,
    "s.\\n": 1789,
    "digits": 1790,
    "ticks": 1791,
    "fir": 1792,
    "prevc": 1793,
    "prevr": 1794,
    "ls": 1795,
    "nx": 1796,
    "ff": 1797,
    "used": 1798,
    "iso": 1799,
    "chrColor": 1800,
    "color": 1801,
    "perColor": 1802,
    "perRowColor": 1803,
    "SIZE": 1804,
    "shorts": 1805,
    "anomalyFound": 1806,
    "matriz": 1807,
    "suma": 1808,
    "prom": 1809,
    "pass": 1810,
    "k+1": 1811,
    "'x": 1812,
    "tmp1": 1813,
    "tmp3": 1814,
    "isRow": 1815,
    "last_stripe": 1816,
    "current_stripe": 1817,
    "stripe": 1818,
    "str.find_first_not_of": 1819,
    ":npos": 1820,
    "fre": 1821,
    "2005": 1822,
    "m-2": 1823,
    "does": 1824,
    "n-2": 1825,
    "Print": 1826,
    "stderr": 1827,
    "prev": 1828,
    "'z": 1829,
    "func": 1830,
    "goto": 1831,
    "b=true": 1832,
    "upLetter": 1833,
    "letter": 1834,
    "downLetter": 1835,
    "palindrom": 1836,
    "begin": 1837,
    "numW": 1838,
    "numL": 1839,
    "word": 1840,
    "readn": 1841,
    "200007": 1842,
    "num/2": 1843,
    "j=n-1": 1844,
    "cmp": 1845,
    "ch2-": 1846,
    "chk": 1847,
    "untile": 1848,
    "-w": 1849,
    "1-": 1850,
    "998244353": 1851,
    "ONLINE__JUDGE": 1852,
    "ac": 1853,
    "lss": 1854,
    "act": 1855,
    "reverse": 1856,
    "s2.begin": 1857,
    "s2.end": 1858,
    "s1.size": 1859,
    "setf": 1860,
    "mi": 1861,
    "-1e9": 1862,
    "1002": 1863,
    "m/2": 1864,
    "inclsuive": 1865,
    "k=0": 1866,
    "m-i-1": 1867,
    "-s": 1868,
    "_=": 1869,
    "isP": 1870,
    "s.at": 1871,
    "v4": 1872,
    "can_change": 1873,
    "t=int": 1874,
    "n-1-i": 1875,
    "-2": 1876,
    "k=x-1": 1877,
    "lo++": 1878,
    "semicolumn": 1879,
    "T=int": 1880,
    "S=string": 1881,
    "ac=true": 1882,
    "t1=S": 1883,
    "-97": 1884,
    "t2=S": 1885,
    "t1-t2": 1886,
    "ac=false": 1887,
    "qpow": 1888,
    "again": 1889,
    "inve": 1890,
    "pri_num": 1891,
    "palin": 1892,
    "there": 1893,
    "g1": 1894,
    "YES|n": 1895,
    "palindrome": 1896,
    "modPow": 1897,
    "nCr": 1898,
    "Sieve": 1899,
    "1000009": 1900,
    "1000006": 1901,
    "factorial": 1902,
    "catalan": 1903,
    "isCheck": 1904,
    "a+1": 1905,
    "b+1": 1906,
    "str=string": 1907,
    "tam=int": 1908,
    "teste": 1909,
    "tam": 1910,
    "i=int": 1911,
    "lim=tam/2": 1912,
    "lim": 1913,
    "-str": 1914,
    "tam-i": 1915,
    "ncasos=int": 1916,
    "ncasos": 1917,
    "proverka": 1918,
    "othewise": 1919,
    "57": 1920,
    "*pre": 1921,
    "*end": 1922,
    "check_palindrome": 1923,
    "b2": 1924,
    "'b": 1925,
    "'y": 1926,
    "alphabetic": 1927,
    "order": 1928,
    "previous": 1929,
    "before": 1930,
    "code": 1931,
    "lines": 1932,
    "candidate": 1933,
    "votes": 1934,
    "cond": 1935,
    "Max": 1936,
    "-9999999": 1937,
    "ending": 1938,
    "INFF": 1939,
    "1000000000000000005LL": 1940,
    "priority_queue": 1941,
    "liz": 1942,
    "top": 1943,
    "pop": 1944,
    "ncandidates": 1945,
    "nvotes": 1946,
    "changedVotes": 1947,
    "bestIndex": 1948,
    "bestVotes": 1949,
    "least": 1950,
    "leave": 1951,
    "a*b/gcd": 1952,
    "pq": 1953,
    "priority": 1954,
    "queue": 1955,
    "counts=0": 1956,
    "a+2": 1957,
    "a+n+1": 1958,
    "-10000": 1959,
    "forward": 1960,
    "front": 1961,
    "biggest": 1962,
    "pq.empty": 1963,
    "pq.top": 1964,
    "g=0": 1965,
    "highnum=0": 1966,
    "highid=-1": 1967,
    "highnum": 1968,
    "highid=y": 1969,
    "highid": 1970,
    "g=1": 1971,
    "log": 1972,
    "points": 1973,
    "allocate": 1974,
    "block": 1975,
    "memory": 1976,
    "smallest": 1977,
    "largest": 1978,
    "runs": 1979,
    "elemetns": 1980,
    "loops": 1981,
    "ascending": 1982,
    "forever": 1983,
    "107": 1984,
    "i=2": 1985,
    "p=a": 1986,
    "vote": 1987,
    "most": 1988,
    "max_element": 1989,
    "cnt++": 1990,
    "choc": 1991,
    "voters": 1992,
    "maxv": 1993,
    "loc": 1994,
    "having": 1995,
    "form": 1996,
    "l=": 1997,
    "arr+1": 1998,
    "arr+n": 1999,
    "font": 2000,
    "-ans": 2001,
    "comp": 2002,
    "fl": 2003,
    "my": 2004,
    "voters.top": 2005,
    "modn": 2006,
    "p.top": 2007,
    "dq": 2008,
    "greatest": 2009,
    "q=priority_queue": 2010,
    "temp=0": 2011,
    "t=first": 2012,
    "item": 2013,
    "f1": 2014,
    "TRIANGLE": 2015,
    "SEGMENT": 2016,
    "IMPOSSIBLE": 2017,
    "interchange": 2018,
    "xx+4": 2019,
    "b=0": 2020,
    "b++": 2021,
    "valuef": 2022,
    "IMPOSSIBLE\\n": 2023,
    "SEGMENT\\n": 2024,
    "TRIANGLE\\n": 2025,
    "terminate": 2026,
    "a+4": 2027,
    "OR|": 2028,
    "'TRIANGLE": 2029,
    "arr=": 2030,
    "arr+4": 2031,
    "+v": 2032,
    "best": 2033,
    "best=integer": 2034,
    "v=": 2035,
    "par": 2036,
    "'IMPOSSIBLE": 2037,
    "checkDegenerate": 2038,
    "exchange": 2039,
    "seg": 2040,
    "normal": 2041,
    "deg": 2042,
    "b+c": 2043,
    "constants": 2044,
    "tri": 2045,
    "reopen": 2046,
    "debug.txt": 2047,
    "equ": 2048,
    "|=": 2049,
    "1,2,3,4": 2050,
    "continuing": 2051,
    "j'th": 2052,
    "i'th": 2053,
    "k'th": 2054,
    "triangle": 2055,
    "segment": 2056,
    "stat": 2057,
    "match": 2058,
    "base": 2059,
    "arrr2": 2060,
    "pad": 2061,
    "5e5": 2062,
    "mt": 2063,
    "pow": 2064,
    "s.length": 2065,
    "s.find": 2066,
    "s.substr": 2067,
    "fast_exp": 2068,
    "non": 2069,
    "theen": 2070,
    "res*base": 2071,
    "base^2": 2072,
    "re": 2073,
    "longn": 2074,
    "mg": 2075,
    "conv": 2076,
    "ChuyenDoi": 2077,
    "000000000000000000": 2078,
    "flat": 2079,
    "=char": 2080,
    "524289": 2081,
    "tran": 2082,
    "biao": 2083,
    "op": 2084,
    "resulf": 2085,
    "alter": 2086,
    "x.size": 2087,
    "dig": 2088,
    "cnt.find": 2089,
    "cnt.end": 2090,
    "tipo": 2091,
    "usa": 2092,
    "us": 2093,
    "inter": 2094,
    "poss": 2095,
    "x=": 2096,
    "siz=": 2097,
    "-siz": 2098,
    "s2+s1": 2099,
    "ope": 2100,
    "bi": 2101,
    "query": 2102,
    "place": 2103,
    "num.size": 2104,
    "cast": 2105,
    "tobin": 2106,
    "constance": 2107,
    "1000*1000*1000": 2108,
    "var": 2109,
    "prepend": 2110,
    "maxm": 2111,
    "mp1": 2112,
    "mp2": 2113,
    "getsolved": 2114,
    "alpha": 2115,
    "mymap": 2116,
    "reads": 2117,
    "delete": 2118,
    "mymap=map": 2119,
    "sum=0": 2120,
    "ch=char": 2121,
    "base=0": 2122,
    "remains": 2123,
    "i=length": 2124,
    "k=s": 2125,
    "-'0": 2126,
    "res.find_first_not_of": 2127,
    "res.substr": 2128,
    "pot": 2129,
    "s=+": 2130,
    "num=0": 2131,
    "+pot": 2132,
    "pot*10": 2133,
    "aux/10": 2134,
    "IntToPattern": 2135,
    "patt": 2136,
    "nl": 2137,
    "el": 2138,
    "sl": 2139,
    "Cnt": 2140,
    "msk": 2141,
    "x+k": 2142,
    "k*2": 2143,
    "c=+": 2144,
    "c=-": 2145,
    "ch=+": 2146,
    "cn": 2147,
    "p=": 2148,
    "x/10": 2149,
    "a/__gcd": 2150,
    "*b": 2151,
    "dX": 2152,
    "dY": 2153,
    "map1": 2154,
    "lens-i": 2155,
    "newlien": 2156,
    "get_str": 2157,
    "n=num": 2158,
    "mp=map": 2159,
    "num=long": 2160,
    "sp=string": 2161,
    "sp": 2162,
    "str=get_str": 2163,
    "mcnt=0": 2164,
    "lead=0": 2165,
    "s=substring": 2166,
    "sp-cnt": 2167,
    "mcnt": 2168,
    "'S": 2169,
    "rr": 2170,
    "cc": 2171,
    "put": 2172,
    "row=array": 2173,
    "Create": 2174,
    "execute": 2175,
    "cakes=0": 2176,
    "==0": 2177,
    "cakes": 2178,
    "bools": 2179,
    "default": 2180,
    "cols": 2181,
    "respectively": 2182,
    "r=": 2183,
    "j=": 2184,
    "eaten": 2185,
    "Input": 2186,
    "Solve": 2187,
    "hor": 2188,
    "ver": 2189,
    "sets": 2190,
    "cake": 2191,
    "noteaten_r": 2192,
    "noteaten_c": 2193,
    "freq": 2194,
    "freq1": 2195,
    "zeroes": 2196,
    "i-cnt": 2197,
    "chn": 2198,
    "chm": 2199,
    "ans=integer": 2200,
    "s2.size": 2201,
    "ro": 2202,
    "'n": 2203,
    "rowsDeleted": 2204,
    "**inputArr": 2205,
    "*rows": 2206,
    "*cols": 2207,
    "inputArr": 2208,
    "lenght": 2209,
    "rowCount": 2210,
    "colCount": 2211,
    "prunt": 2212,
    "rb": 2213,
    "cb": 2214,
    "lenghts": 2215,
    "cont2": 2216,
    "aux1": 2217,
    "aux2": 2218,
    "cont=0": 2219,
    "cont2=0": 2220,
    "aux1=0": 2221,
    "aux2=0": 2222,
    "@": 2223,
    "trans": 2224,
    "onf": 2225,
    "rowSet": 2226,
    "colSet": 2227,
    "eatable": 2228,
    "purple": 2229,
    "Power": 2230,
    "green": 2231,
    "blue": 2232,
    "Space": 2233,
    "orange": 2234,
    "Soul": 2235,
    "red": 2236,
    "Reality": 2237,
    "yellow": 2238,
    "Mind": 2239,
    "00": 2240,
    "names": 2241,
    "need": 2242,
    "null": 2243,
    "maxn=100010": 2244,
    "'p": 2245,
    "'g": 2246,
    "'o": 2247,
    "'r": 2248,
    "ignore": 2249,
    "comparison": 2250,
    "Power\\nTime\\nSpace\\nSoul\\nReality\\nMind\\n": 2251,
    "rfind": 2252,
    "x5": 2253,
    "x6": 2254,
    "output=array": 2255,
    "temp=string": 2256,
    "out=array": 2257,
    "=false": 2258,
    "t=0": 2259,
    "rean": 2260,
    "vvod": 2261,
    "reshala": 2262,
    "gol": 2263,
    "kachok": 2264,
    "y=": 2265,
    "nome": 2266,
    "0s": 2267,
    "mas": 2268,
    "mas1": 2269,
    "inclusve": 2270,
    "Names": 2271,
    "DeleteIt": 2272,
    "replace": 2273,
    "Colours": 2274,
    "s_color": 2275,
    "s_ip": 2276,
    "si": 2277,
    "k=array": 2278,
    "vet": 2279,
    "Power\\n": 2280,
    "Time\\n": 2281,
    "Space\\n": 2282,
    "Soul\\n": 2283,
    "Reality\\n": 2284,
    "Mind\\n": 2285,
    "puno": 2286,
    "nula": 2287,
    "nope": 2288,
    "GetStone": 2289,
    "FindNotFound": 2290,
    "stone": 2291,
    "stones": 2292,
    "ret=false": 2293,
    "ret=true": 2294,
    "stones=vector": 2295,
    "st=vector": 2296,
    "not_found=vector": 2297,
    "not_found": 2298,
    "gem": 2299,
    "have": 2300,
    "mass": 2301,
    "6-n": 2302,
    "ans1": 2303,
    "ans2": 2304,
    "ans3": 2305,
    "ans4": 2306,
    "ans5": 2307,
    "ans6": 2308,
    "sir": 2309,
    "colors": 2310,
    "strcmp": 2311,
    "gems": 2312,
    "iterating": 2313,
    "^": 2314,
    "-x": 2315,
    "exclusivev": 2316,
    "101-element": 2317,
    "signal": 2318,
    "postdecremented": 2319,
    "vis=false": 2320,
    "vis=true": 2321,
    "bt": 2322,
    "bohlam": 2323,
    "list": 2324,
    "duplicate": 2325,
    "consecutive": 2326,
    "150": 2327,
    "blag": 2328,
    "1,000-element": 2329,
    "Boolean": 2330,
    "cek": 2331,
    "INF_INT": 2332,
    "2147483647": 2333,
    "INF_LL": 2334,
    "9223372036854775807LL": 2335,
    "INF_ULL": 2336,
    "18446744073709551615Ull": 2337,
    "P": 2338,
    "92540646808111039LL": 2339,
    "Move": 2340,
    "Move_": 2341,
    "lasagna": 2342,
    "696969": 2343,
    "cyka": 2344,
    "blyat": 2345,
    "A=0": 2346,
    "p=set": 2347,
    "a=int": 2348,
    "l=int": 2349,
    "l=size": 2350,
    "buttons": 2351,
    "bulbs": 2352,
    "marks": 2353,
    "connected": 2354,
    "bulb_no": 2355,
    "is_possible": 2356,
    "ccreate": 2357,
    "inserting": 2358,
    "sizeofb": 2359,
    "105-elt": 2360,
    "bulb": 2361,
    "towhid": 2362,
    "towhid.size": 2363,
    "tail": 2364,
    "F": 2365,
    "removeDuplicates": 2366,
    "j++": 2367,
    "bul": 2368,
    "sizebul": 2369,
    "LIM": 2370,
    "nb": 2371,
    "nbulb": 2372,
    "qt": 2373,
    "20001": 2374,
    "An": 2375,
    "m-element": 2376,
    "turned": 2377,
    "contain": 2378,
    "10^9+7": 2379,
    "res*x": 2380,
    "x*x": 2381,
    "esclusive": 2382,
    "g=int": 2383,
    "g-1": 2384,
    "done=true": 2385,
    "asc": 2386,
    "t/": 2387,
    "dt": 2388,
    "nr": 2389,
    "Control": 2390,
    "jumps": 2391,
    "curlower": 2392,
    "NeedTime": 2393,
    "t=": 2394,
    "tim": 2395,
    "tim=tim+": 2396,
    "2*m-2": 2397,
    "tim=": 2398,
    "seed": 2399,
    "131": 2400,
    "1200": 2401,
    "fi": 2402,
    "gotodown": 2403,
    "gotoup": 2404,
    "moves": 2405,
    "piso": 2406,
    "dist": 2407,
    "2*": 2408,
    "M-1": 2409,
    "ts": 2410,
    "xxx": 2411,
    "ud": 2412,
    "control": 2413,
    "ax": 2414,
    "l/2": 2415,
    "work": 2416,
    "0if": 2417,
    "ans=": 2418,
    "over": 2419,
    "timr": 2420,
    "max3": 2421,
    "adji": 2422,
    "adjo": 2423,
    "10000000000": 2424,
    "dif": 2425,
    "-=": 2426,
    "-f": 2427,
    "u_d": 2428,
    "d_u": 2429,
    "nap": 2430,
    "et": 2431,
    "t/m": 2432,
    "t/m+1": 2433,
    "tem": 2434,
    "temp=": 2435,
    "s-": 2436,
    "integerss": 2437,
    "tm": 2438,
    "ttt": 2439,
    "0x3FFFFFFF": 2440,
    "lca": 2441,
    "lcu": 2442,
    "peso": 2443,
    "contains": 2444,
    "LCA": 2445,
    "v/2": 2446,
    "u/2": 2447,
    "3e5": 2448,
    "log2": 2449,
    "cal": 2450,
    "parent": 2451,
    "route": 2452,
    "pu": 2453,
    "mxcommon": 2454,
    "rta": 2455,
    "cost": 2456,
    "131071": 2457,
    "sel": 2458,
    "depth": 2459,
    "dep_u": 2460,
    "dep_v": 2461,
    "A.find": 2462,
    "A.end": 2463,
    "decrementim": 2464,
    "temp0": 2465,
    "getPr": 2466,
    "getAns": 2467,
    "finish": 2468,
    "setTree": 2469,
    "send": 2470,
    "cost=map": 2471,
    "poskupi": 2472,
    "cena": 2473,
    "q=int": 2474,
    "w=long": 2475,
    "v=long": 2476,
    "q-1": 2477,
    "e=long": 2478,
    "lol=pair": 2479,
    "signature": 2480,
    "finder": 2481,
    "q=b": 2482,
    "x=lca": 2483,
    "log_=1": 2484,
    "y=log2": 2485,
    "x=log2": 2486,
    "2^log_": 2487,
    "log_": 2488,
    "i=log_": 2489,
    "y-2^": 2490,
    "substract": 2491,
    "2^": 2492,
    "p/2": 2493,
    "q/2": 2494,
    "e=a": 2495,
    "lol=e": 2496,
    "lol=a": 2497,
    "=z": 2498,
    "e=b": 2499,
    "lol=b": 2500,
    "dis": 2501,
    "anc": 2502,
    "qq": 2503,
    "inteiger": 2504,
    "tht": 2505,
    "p.find": 2506,
    "p.end": 2507,
    "dfs2": 2508,
    "tree": 2509,
    "add_path": 2510,
    "wh": 2511,
    "max1": 2512,
    "++freq": 2513,
    "pnt": 2514,
    "comparator": 2515,
    "brr": 2516,
    "500000": 2517,
    "it-": 2518,
    "main_str": 2519,
    "start_index": 2520,
    "str_for_compare": 2521,
    "reg": 2522,
    "occ": 2523,
    "ks": 2524,
    "-1000000007": 2525,
    "index1": 2526,
    "index2": 2527,
    "tmp_ans": 2528,
    "cent": 2529,
    "present": 2530,
    "a=string": 2531,
    "max=0": 2532,
    "j=i+1": 2533,
    "m=0": 2534,
    "i+m": 2535,
    "j+m": 2536,
    "max=m": 2537,
    "record": 2538,
    "intege": 2539,
    "str.size": 2540,
    "sub": 2541,
    "str.substr": 2542,
    "str.find": 2543,
    "sub.length": 2544,
    "all.size": 2545,
    "all=set": 2546,
    "i=size": 2547,
    "s-1": 2548,
    "s-i": 2549,
    "inserti": 2550,
    "s-i+1": 2551,
    "elseif": 2552,
    "v-1": 2553,
    "=k": 2554,
    "j=i-1": 2555,
    "fpr": 2556,
    "opposite": 2557,
    "forth": 2558,
    "deque": 2559,
    "deq": 2560,
    "countl": 2561,
    "countr": 2562,
    "V": 2563,
    "Bn": 2564,
    "preorder": 2565,
    "rearorder": 2566,
    "i=n": 2567,
    "bf": 2568,
    "l=false": 2569,
    "cou": 2570,
    "1e8": 2571,
    "ct": 2572,
    "marked": 2573,
    "seen=array": 2574,
    "K=int": 2575,
    "answer=0": 2576,
    "seen": 2577,
    "i=N-1": 2578,
    "head": 2579,
    "N=1000006": 2580,
    "inf=1000000007": 2581,
    "Arr=array": 2582,
    "n+2": 2583,
    "Arr": 2584,
    "lft=1": 2585,
    "lft": 2586,
    "rgt=n": 2587,
    "rgt": 2588,
    "manx": 2589,
    "remove_zeros": 2590,
    "ten": 2591,
    "bx": 2592,
    "cry": 2593,
    "a.size": 2594,
    "b.size": 2595,
    "ta": 2596,
    "tb": 2597,
    "ans.size": 2598,
    "era": 2599,
    "p.size": 2600,
    "srings": 2601,
    "a.begin": 2602,
    "a.end": 2603,
    "b.begin": 2604,
    "b.end": 2605,
    "a_": 2606,
    "b_": 2607,
    "c_": 2608,
    "remove_zero": 2609,
    "lzl": 2610,
    "x=1": 2611,
    "z++": 2612,
    "zeroRemover": 2613,
    "remove0": 2614,
    "gum": 2615,
    "10^k": 2616,
    "320": 2617,
    "n/10": 2618,
    "d*pow": 2619,
    "a+b": 2620,
    "A+B": 2621,
    "zx": 2622,
    "removeZeros": 2623,
    "tempa": 2624,
    "tempb": 2625,
    "rem1": 2626,
    "newa": 2627,
    "newb": 2628,
    "newsum": 2629,
    "putchar": 2630,
    "remv": 2631,
    "div": 2632,
    "static": 2633,
    "ostringstream": 2634,
    "getNum": 2635,
    "currMod": 2636,
    "zy": 2637,
    "removeZero": 2638,
    "takeing": 2639,
    "0.01": 2640,
    "three": 2641,
    "bit-wise": 2642,
    "returnr": 2643,
    "es": 2644,
    "ad": 2645,
    "cd": 2646,
    "bg": 2647,
    "cs": 2648,
    "multiplier": 2649,
    "bd": 2650,
    "darVuelta": 2651,
    "dig1": 2652,
    "quitarZeros": 2653,
    "sum1_str": 2654,
    "sum2_str": 2655,
    "string_int": 2656,
    "int_string": 2657,
    "ta+tb+cry": 2658,
    "p/10": 2659,
    "a1/10": 2660,
    "mul1": 2661,
    "mul2": 2662,
    "v/10": 2663,
    "/10": 2664,
    "y-1": 2665,
    "converted": 2666,
    "ss.str": 2667,
    "ss1": 2668,
    "anew": 2669,
    "ss2": 2670,
    "bnew": 2671,
    "ss3": 2672,
    "cnew": 2673,
    "matching": 2674,
    "removed": 2675,
    "stringstream": 2676,
    "geek": 2677,
    "geek1": 2678,
    "geek2": 2679,
    "gcd1": 2680,
    "modx": 2681,
    "1000000009LL": 2682,
    "ans2=": 2683,
    "adj": 2684,
    "pt": 2685,
    "en": 2686,
    "ne": 2687,
